<?php

return [
    'name' => 'Ім\'я',
    'Name' => 'Ім\'я',
    'email' => 'Електронна пошта',
    'password' => 'Пароль',
    'display_name' => 'Ім\'я що відображається',
    'last_name' => 'Прізвище',
    'address' => 'Адреса',
    'id' => 'id',
    'user' => 'Користувач',
    'all_users' => 'Всі користувачі',
    'admin title all user' => 'Список всіх користувачів',
    'roles' => 'Ролі',
    'permissions' => 'Дозволи',
    'permission' => 'Дозволи',
    'remember_me' => 'Запам\'ятати мене',
    'Forgot your password?' => 'Забули пароль?',
    'Log in' => 'Вхід',
    'Log Out' => 'Вихід',
    'phone' => 'Номер телефону',
    'status' => 'Статус',
    'status_blocked' => 'Заблокованний',
    'status_active' => 'Активний',
    'status_pending' => 'Очікує',
    'information' => 'Інформація',
    'roles_and_permissions' => 'Ролі та дозволи',
    'change_password' => 'Змінити пароль',
    'new_password' => 'Новий пароль',
    'created_at' => 'Дата створення',
    'language' => 'Мова',
    'not_found_user' => 'Обліковий запис з цією електронною поштою не знайдено',
    'not_confirmed_user' => 'Ваш обліковий запис не підтверджено. Будь ласка, перевірте свою електронну пошту та активуйте обліковий запис',
    'blocked_user' => 'Ваш обліковий запис заблоковано. Зверніться до служби підтримки за адресою support@oiltime.com',
    'not_robot' => 'Будь ласка, підтвердіть, що ви не робот',
    'required' => 'Поле обов\'язкове для заповнення',
    'only_letters' => 'Допустимі лише літери',
    'max_size' => 'Максимальна довжина – :max символів',
    'incorrect_credential' => 'Неправильна почта або пароль',
    'email_validate' => [
        'required' => 'Електронна пошта обов\'язкова',
        'email' => 'Електронна пошта повинна бути у правильному форматі',
        'unique' => 'Електронна пошта вже використовується',
        'exists' => 'Обліковий запис з цією електронною поштою не знайдено',
    ],
    'password_validate' => [
        'required' => 'Пароль повинен містити щонайменше :min символів',
        'min' => 'Пароль повинен містити щонайменше :min символів',
        'letters' => 'Пароль field must contain at least one letter',
        'mixed' => 'Пароль повинен містити щонайменше одну велику літеру та одну малу літеру',
        'numbers' => 'Пароль повинен містити щонайменше одну цифру',
        'symbols' => 'Пароль повинен містити щонайменше один спеціальний символ (наприклад: @, #, $, !, %, ^, &, ]',
        'confirmed' => 'Повинно збігатися з полем "Пароль"',
    ],
    'new_password_validate' => [
        'required' => 'Новий пароль повинен містити щонайменше :min символів',
        'min' => 'Новий пароль повинен містити щонайменше :min символів',
        'letters' => 'Новий пароль field must contain at least one letter',
        'mixed' => 'Новий пароль повинен містити щонайменше одну велику літеру та одну малу літеру',
        'numbers' => 'Новий пароль повинен містити щонайменше одну цифру',
        'symbols' => 'Новий пароль повинен містити щонайменше один спеціальний символ (наприклад: @, #, $, !, %, ^, &, ]',
        'confirmed' => 'Повинно збігатися з полем "Новий пароль"',
        'same_with_old_password' => 'Новий пароль не може бути таким самим, як старий пароль',
        'change' => 'Ваш пароль успішно змінено',
    ],
    'old_password' => [
        'required' => 'Старий пароль обов\'язковий для заповнення',
        'exists' => 'Старий пароль введено невірно',
    ],
    'ua_phone' => 'Формат: +380XXXXXXXXX (12 символів, починається з +380]',
    'email_verification' => [
        'success' => 'Електронна пошта успішно підтверджена',
        'exprired' => 'Час підтвердження електронної пошти закінчився',
        'already_verified' => 'Електронна пошта вже підтверджена',
        'expired' => 'Час підтвердження електронної пошти минув',
    ],
    'mail_confirmation' => [
        'pls_verify' => 'На Вашу електронну пошту було надіслано лист для підтвердження реєстрації',
        'too_many_requests' => 'Будь ласка, зверніться до служби підтримки за адресою support@oiltime.com',
        'subject' => 'Реєстрація на платформі OilTime',
        'greeting' => 'Шановний(а] :name,',
        'thanks' => 'Дякуємо за реєстрацію на платформі <strong>OilTime</strong>!',
        'confirm_text' => 'Для завершення процесу реєстрації, будь ласка, підтвердіть свою електронну пошту, натиснувши на посилання нижче:',
        'confirm_button' => 'Підтвердити реєстрацію',
        'note' => '🔔 Зверніть увагу:',
        'validity' => 'Це посилання буде дійсним протягом <strong>24 годин</strong>.',
        'repeat' => 'Якщо Ви не завершите реєстрацію протягом цього часу, необхідно буде пройти процес повторно.',
        'ignore' => 'Якщо Ви не запитували реєстрацію, просто проігноруйте цей лист.',
        'support' => 'Якщо виникли труднощі, зверніться до служби підтримки:',
        'team' => 'З найкращими побажаннями,<br><strong>Команда OilTime</strong>',
    ],
    'password_forgot' => [
        'send' => 'Посилання для відновлення пароля було надіслано на вашу електронну пошту',
        'fail_send' => 'Якщо ви не отримали посилання, зверніться до служби підтримки',
        'subject' => 'Відновлення пароля на платформі OilTime',
        'expire_token' => 'Посилання для активації облікового запису недійсне. Будь ласка, повторіть спробу',
        'change' => 'Ваш пароль було успішно змінено. Ви можете увійти до системи з новим паролем',
        'content' => '
            <h2>Відновити пароль</h2>
            <p>Шановний(а] :name,</p>
            <p>Ви запросили відновлення пароля для свого облікового запису на платформі <strong>OilTime</strong>.</p>
            <p>Щоб створити новий пароль, натисніть на посилання нижче:</p>
            <p><a href=\':url\' class=\'button\'>Відновити пароль</a></p>
            <p><strong>🔔 Зверніть увагу:</strong></p>
            <ul>
                <li>Це посилання буде дійсним протягом 24 годин.</li>
                <li>Якщо Ви не завершите процес відновлення пароля протягом цього часу, необхідно буде повторно запросити відновлення.</li>
            </ul>
            <p><strong>Не запитували зміну пароля?</strong></p>
            <p>Якщо Ви не робили запит на зміну пароля, просто проігноруйте цей лист.</p>
            <p><strong>Додаткова допомога:</strong></p>
            <p>Якщо Ви не отримали посилання або виникли інші труднощі, будь ласка, зверніться до служби підтримки: <a href=\'mailto:support@oiltime.com\'>support@oiltime.com</a>.</p>
            <p>З найкращими побажаннями,<br><strong>Команда OilTime</strong></p>
        ',
    ],
    'profile' => [
        'update' => 'Ваші дані успішно оновлені',
    ],
    'pricelist' => [
        'send' => 'Ваш оновлений прайс-лист від OilTime',
        'fail_send' => 'Не вдалося завантажити прайс-лист. Спробуйте пізніше',
        'subject' => 'Ваш оновлений прайс-лист від OilTime :date',
        'content' => '
            <p>Шановний(а] :name,</p>
            <p>Ми підготували для Вас актуальний прайс-лист, який включає всі останні оновлення цін та пропозицій.</p>
            <p><a href=\':url\' class=\'button\'>Завантажити прайс-лист</a></p>
            <p>Цей прайс-лист створений для Вашої зручності, щоб Ви завжди мали доступ до актуальної інформації про товари. </p>
            <p>З повагою,<br><strong>Команда OilTime</strong></p>
        ',
    ],
    'activate_whosaler' => [
        'subject' => 'Ваш обліковий запис на платформі активовано',
        'content' => '<p>Шановний(а] :name,</p>
            <p>Ми раді повідомити, що ваш обліковий запис на платформі <strong></strong> успішно активовано! Тепер ви маєте доступ до всіх функцій та ресурсів платформи.</p>
            <p>Якщо виникли труднощі, зверніться до служби підтримки: <a href=\'mailto:\'></a>.</p>
            <p>Ми раді бачити Вас серед наших користувачів!</p>
            <p>З найкращими побажаннями,<br><strong>Команда </strong></p>',
    ],
    'delete_whosaler' => [
        'subject' => 'Видалення облікового запису на платформі',
        'content' => '<p>Шановний(а] :name,</p>
            <p>Ми хотіли повідомити, що ваш обліковий запис на платформі був видалений. Це може бути результатом припинення вашої співпраці з нашою компанією або завершення потреби в доступі до нашої платформи.</p>
            <p>Ваш обліковий запис було видалено, і доступ до платформи припинений. Якщо це сталося помилково, будь ласка, зв\'яжіться з нами за допомогою наступних контактів.</p>
            <p>Якщо виникли труднощі, зверніться до служби підтримки: <a href=\'mailto:\'></a>.</p>
            <p>З найкращими побажаннями,<br><strong>Команда </strong></p>',
    ],
    'user_type' => 'Тип',
    'admin' => 'Адмін',
    'customer' => 'Клієнт',
    'store' => 'Магазин',
    'wholesaler' => 'Оптовик',
    'wishlist' => 'Вішліст',
    'wishlist_section' => 'Вішліст',
    'addresses_section' => 'Адреси',
    'wishlist_type' => 'Тип',
    'wishlist_item' => 'Елемент',
    'wishlist_added_at' => 'Додано',
    'no_wishlist_items' => 'У користувача немає елементів у вішлісті.',
    'cart' => 'Кошик',
    'cart_section' => 'Кошик',
    'no_cart_products' => 'У користувача немає товарів у кошику.',
    'open_cart' => 'Відкрити в модулі Кошик',
    'shopping' => 'Кошик і вішліст',
    'docs' => [
        'title' => 'Керування користувачами',
        'subtitle' => 'Система керування обліковими записами, профілями та доступом.',
        'roles_permissions_title' => 'Ролі та дозволи',
        'roles_permissions_desc' => 'Кожному користувачу можна призначити кілька ролей та окремих дозволів для гнучкого керування доступом.',
        'password_title' => 'Керування паролями',
        'password_desc' => 'Адміністратори можуть примусово змінювати паролі користувачів. Система підтримує надійні хеші та правила перевірки складності.',
        'tech_title' => 'Технічні деталі',
        'admin_part' => 'Адмін-частина',
        'api_part' => 'API-частина',
        'endpoints' => 'Ендпоінти',
        'fields' => 'Поля',
    ],
    'index_title' => 'Користувачі',
    'chooseTrashed' => 'Виберіть "Видалено"',
    'withTrashed' => 'Зі сміттєвим кошиком',
    'onlyTrashed' => 'Тільки викинуті',
    'display name' => 'Відображуване ім\'я',
    'User' => 'Користувачі',
    'PENDING' => 'Очікування',
    'ACTIVE' => 'Активний',
    'BLOCKED' => 'Заблоковано',
    'default' => 'За замовчуванням',
    'activate_wholesaler' => [
        'subject' => 'Ваш обліковий запис на платформі активовано',
        'content' => '<p>Шановний :name,</p>
<p>Раді повідомити Вам, що Ваш обліковий запис на платформі <strong></strong> успішно активовано! Тепер Ви маєте доступ до всіх функцій та ресурсів платформи.</p>
<p>Якщо у Вас виникнуть труднощі, зверніться до нашої служби підтримки за адресою: <a href=\'mailto:\'></a>.</p>
<p>Ми раді вітати Вас серед наших користувачів!</p>
<p>З найкращими побажаннями,<br><strong></strong></p>',
    ],
    'delete_wholesaler' => [
        'subject' => 'Видалення облікового запису на платформі',
        'content' => '<p>Шановний/Шановна :name,</p>
<p>Повідомляємо Вас, що Ваш обліковий запис на платформі видалено. Це може бути результатом припинення Вашої співпраці з нашою компанією або завершення Вашої потреби в доступі до нашої платформи.</p>
<p>Ваш обліковий запис видалено, а доступ до платформи OilTime припинено. Якщо це було зроблено помилково, зв\'яжіться з нами, використовуючи наступні дані.</p>
<p>Якщо у Вас виникнуть труднощі, зверніться до нашої служби підтримки за адресою: <a href=\'mailto:\'></a>.</p>
<p>З найкращими побажаннями,<br><strong></strong></p>',
    ],
    'menu_users' => 'користувачі',
    'Admin' => 'Адміністратор',
    'Customer' => 'Клієнт',
    'Permission' => 'Дозвіл',
    'Email' => 'Електронна пошта',
    'First name' => 'Ім\'я',
    'Roles' => 'Ролі',
    'module_name' => 'Користувач',
    'enum_genders' => [
        'MALE' => 'Чоловіча',
        'FEMALE' => 'Жіноча',
    ],
    'addresses' => 'Адреси',
    'no_addresses' => 'У користувача немає збережених адрес.',
    'created_at' => 'Створено',
    'city' => 'Місто',
    'street' => 'Вулиця',
    'house' => 'Будинок',
    'apartment' => 'Квартира',
    'is_main' => 'Основна',
    'middle_name' => 'По батькові',
    'gender' => 'Стать',
    'birthday' => 'Дата народження',
    'avatar' => 'Аватар',
    'current_password' => 'Поточний пароль',
    'password_confirmation' => 'Підтвердження пароля',
];
